export const messageItem = () => { //怎么存的话就随便可以localhost，如果是完整的项目可以从后端调接口，后端会有存聊天记录的数据库
    return [
        {
            name: "小鳄鱼", //姓名
            content: "你叫什么？",
            time: "2023-10-22 19:55:12",
            avatar: "https://wuxie-image.oss-cn-chengdu.aliyuncs.com/image-20231103113745136.png",
        },
        {
            name: "懒大王", //姓名
            content: "我没叫啊",
            time: "2023-10-22 19:56:34",
            avatar: "https://wuxie-image.oss-cn-chengdu.aliyuncs.com/image-20231103113745136.png",
        },
        {
            name: "小鳄鱼", //姓名
            content: "我说你叫什么？",
            time: "2023-10-22 19:57:12",
            avatar: "https://wuxie-image.oss-cn-chengdu.aliyuncs.com/image-20231103113745136.png",
        },
        {
            name: "懒大王", //姓名
            content: "我根本没说话啊",
            time: "2023-10-22 19:58:34",
            avatar: "https://wuxie-image.oss-cn-chengdu.aliyuncs.com/image-20231103113745136.png",
        },
        {
            name: "懒大王", //姓名
            content: "😮😮😮",
            time: "2023-10-22 19:58:54",
            avatar: "https://wuxie-image.oss-cn-chengdu.aliyuncs.com/image-20231103113745136.png",
        },
        {
            name: "小鳄鱼", //姓名
            content: "6",
            time: "2023-10-22 19:59:12",
            avatar: "https://wuxie-image.oss-cn-chengdu.aliyuncs.com/image-20231103113745136.png"
        },
        {
            name: "小鳄鱼", //姓名
            content: "😅",
            time: "2023-10-22 20:00:10",
            avatar: "https://wuxie-image.oss-cn-chengdu.aliyuncs.com/image-20231103113745136.png"
        },
    ]
}

export const emojis = () => {
    return "😀,😁,😂,😃,😄,😅,😆,😉,😊,😋,😎,😍,😘,😗,😙,😚,😇,😐,😑,😶,😏,😣,😥,😮,😯,😪,😫,😴,😌,😛,😜,😝,😒,😓,😔,😕,😲,😷,😖,😞,😟,😤,😢,😭,😦,😧,😨,😬,😰,😱,😳,😵,😡,😠,💘,❤,💓,💔,💕,💖,💗,💙,💚,💛,💜,💝,💞,💟,❣,💪,👈,👉,☝,👆,👇,✌,✋,👌,👍,👎,✊,👊,👋,👏,👐,✍,🍇,🍈,🍉,🍊,🍋,🍌,🍍,🍎,🍏,🍐,🍑,🍒,🍓,🍅,🍆,🌽,🍄,🌰,🍞,🍖,🍗,🍔,🍟,🍕,🍳,🍲,🍱,🍘,🍙,🍚,🍛,🍜,🍝,🍠,🍢,🍣,🍤,🍥,🍡,🍦,🍧,🍨,🍩,🍪,🎂,🍰,🍫,🍬,🍭,🍮,🍯,🍼,☕,🍵,🍶,🍷,🍸,🍹,🍺,🍻,🍴,🌹,🍀,🍎,💰,📱,🌙,🍁,🍂,🍃,🌷,💎,🔪,🔫,🏀,⚽,⚡,👄,👍,🔥,🙈,🙉,🙊,🐵,🐒,🐶,🐕,🐩,🐺,🐱,😺,😸,😹,😻,😼,😽,🙀,😿,😾,🐈,🐯,🐅,🐆,🐴,🐎,🐮,🐂,🐃,🐄,🐷,🐖,🐗,🐽,🐏,🐑,🐐,🐪,🐫,🐘,🐭,🐁,🐀,🐹,🐰,🐇,🐻,🐨,🐼,🐾,🐔,🐓,🐣,🐤,🐥,🐦,🐧,🐸,🐊,🐢,🐍,🐲,🐉,🐳,🐋,🐬,🐟,🐠,🐡,🐙,🐚,🐌,🐛,🐜,🐝,🐞,🦋,😈,👿,👹,👺,💀,☠,👻,👽,👾,💣"
}